IMPL:

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.conversion-tool.aws_cloudwatch_log_subscription_filter.cw-kinesis-subscription-filter will be created
  + resource "aws_cloudwatch_log_subscription_filter" "cw-kinesis-subscription-filter" {
      + destination_arn = (known after apply)
      + distribution    = "Random"
      + id              = (known after apply)
      + log_group_name  = "/qppsf/conversion-tool-impl"
      + name            = "cwlogs-subscription-to-kinesis"
      + role_arn        = (known after apply)
    }

  # module.conversion-tool.aws_iam_policy.cwlogs_to_kinesis_policy will be created
  + resource "aws_iam_policy" "cwlogs_to_kinesis_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "cloudwatch-to-kinesis-impl"
      + path      = "/delegatedadmin/developer/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.conversion-tool.aws_iam_policy.kinesis_lambda_policy_role will be created
  + resource "aws_iam_policy" "kinesis_lambda_policy_role" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "conversiontool_kinesis_lambda_role_policy-impl"
      + path      = "/delegatedadmin/developer/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.conversion-tool.aws_iam_role.cwlogs_to_kinesis will be created
  + resource "aws_iam_role" "cwlogs_to_kinesis" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-east-1.amazonaws.com"
                        }
                      + Sid       = "AllowCloudwatchtoKinesis"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "qppsf-ct-cloudwatch-to-kinesis-impl"
      + name_prefix           = (known after apply)
      + path                  = "/delegatedadmin/developer/"
      + permissions_boundary  = "arn:aws:iam::003384571330:policy/cms-cloud-admin/developer-boundary-policy"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.conversion-tool.aws_iam_role.kinesis_lambda_role will be created
  + resource "aws_iam_role" "kinesis_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "AllowLambda"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "qppsf-ct-kinesis_lambda_role-impl"
      + name_prefix           = (known after apply)
      + path                  = "/delegatedadmin/developer/"
      + permissions_boundary  = "arn:aws:iam::003384571330:policy/cms-cloud-admin/developer-boundary-policy"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.conversion-tool.aws_iam_role_policy_attachment.cwlogs_to_kinesis_policy will be created
  + resource "aws_iam_role_policy_attachment" "cwlogs_to_kinesis_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "qppsf-ct-cloudwatch-to-kinesis-impl"
    }

  # module.conversion-tool.aws_iam_role_policy_attachment.kinesis_lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "kinesis_lambda_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "qppsf-ct-kinesis_lambda_role-impl"
    }

  # module.conversion-tool.aws_kinesis_stream.kinesis-stream-cw-logs will be created
  + resource "aws_kinesis_stream" "kinesis-stream-cw-logs" {
      + arn                       = (known after apply)
      + encryption_type           = "KMS"
      + enforce_consumer_deletion = false
      + id                        = (known after apply)
      + kms_key_id                = "alias/aws/kinesis"
      + name                      = "conversion-tool-impl-kinesis-stream"
      + retention_period          = 192
      + shard_count               = 1
      + tags                      = {
          + "application" = "ConversionTool"
          + "environment" = "impl"
          + "owner"       = "qppar-final-scoring"
          + "project"     = "qppsf-ct"
          + "sensitivity" = "PII/PHI"
        }
      + tags_all                  = {
          + "application" = "ConversionTool"
          + "environment" = "impl"
          + "owner"       = "qppar-final-scoring"
          + "project"     = "qppsf-ct"
          + "sensitivity" = "PII/PHI"
        }

      + stream_mode_details {
          + stream_mode = (known after apply)
        }
    }

  # module.conversion-tool.aws_lambda_event_source_mapping.kinesis_lambda_source will be created
  + resource "aws_lambda_event_source_mapping" "kinesis_lambda_source" {
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + starting_position             = "TRIM_HORIZON"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.conversion-tool.aws_lambda_function.kinesis_cw_lambda will be created
  + resource "aws_lambda_function" "kinesis_cw_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../modules/Kinesis-cloudwatch-splunk.zip"
      + function_name                  = "ConversionTool-impl"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SPLUNK_TOKEN" = (sensitive)
              + "SPLUNK_URL"   = (sensitive)
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.conversion-tool.aws_security_group.ct_app will be updated in-place
  ~ resource "aws_security_group" "ct_app" {
        id                     = "sg-04460af49075eec77"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-013c1f26005939b02",
                ]
              - self             = false
              - to_port          = 8443
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 8443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-013c1f26005939b02",
                ]
              - self             = false
              - to_port          = 8443
            },
          + {
              + cidr_blocks      = []
              + description      = null
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-013c1f26005939b02",
                ]
              + self             = false
              + to_port          = 8443
            },
        ]
        name                   = "conversion-tool-app-impl"
        tags                   = {
            "Name" = "conversion-tool-app-impl"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 10 to add, 1 to change, 0 to destroy.

PROD:

Terraform will perform the following actions:

  # module.conversion-tool.aws_cloudwatch_log_subscription_filter.cw-kinesis-subscription-filter will be created
  + resource "aws_cloudwatch_log_subscription_filter" "cw-kinesis-subscription-filter" {
      + destination_arn = (known after apply)
      + distribution    = "Random"
      + id              = (known after apply)
      + log_group_name  = "/qppsf/conversion-tool-prod"
      + name            = "cwlogs-subscription-to-kinesis"
      + role_arn        = (known after apply)
    }

  # module.conversion-tool.aws_iam_policy.cwlogs_to_kinesis_policy will be created
  + resource "aws_iam_policy" "cwlogs_to_kinesis_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "cloudwatch-to-kinesis-prod"
      + path      = "/delegatedadmin/developer/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.conversion-tool.aws_iam_policy.kinesis_lambda_policy_role will be created
  + resource "aws_iam_policy" "kinesis_lambda_policy_role" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "conversiontool_kinesis_lambda_role_policy-prod"
      + path      = "/delegatedadmin/developer/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.conversion-tool.aws_iam_role.cwlogs_to_kinesis will be created
  + resource "aws_iam_role" "cwlogs_to_kinesis" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-east-1.amazonaws.com"
                        }
                      + Sid       = "AllowCloudwatchtoKinesis"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "qppsf-ct-cloudwatch-to-kinesis-prod"
      + name_prefix           = (known after apply)
      + path                  = "/delegatedadmin/developer/"
      + permissions_boundary  = "arn:aws:iam::003384571330:policy/cms-cloud-admin/developer-boundary-policy"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.conversion-tool.aws_iam_role.kinesis_lambda_role will be created
  + resource "aws_iam_role" "kinesis_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "AllowLambda"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "qppsf-ct-kinesis_lambda_role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/delegatedadmin/developer/"
      + permissions_boundary  = "arn:aws:iam::003384571330:policy/cms-cloud-admin/developer-boundary-policy"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.conversion-tool.aws_iam_role_policy_attachment.cwlogs_to_kinesis_policy will be created
  + resource "aws_iam_role_policy_attachment" "cwlogs_to_kinesis_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "qppsf-ct-cloudwatch-to-kinesis-prod"
    }

  # module.conversion-tool.aws_iam_role_policy_attachment.kinesis_lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "kinesis_lambda_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "qppsf-ct-kinesis_lambda_role-prod"
    }

  # module.conversion-tool.aws_kinesis_stream.kinesis-stream-cw-logs will be created
  + resource "aws_kinesis_stream" "kinesis-stream-cw-logs" {
      + arn                       = (known after apply)
      + encryption_type           = "KMS"
      + enforce_consumer_deletion = false
      + id                        = (known after apply)
      + kms_key_id                = "alias/aws/kinesis"
      + name                      = "conversion-tool-prod-kinesis-stream"
      + retention_period          = 192
      + shard_count               = 1
      + tags                      = {
          + "application" = "ConversionTool"
          + "environment" = "prod"
          + "owner"       = "qppar-final-scoring"
          + "project"     = "qppsf-ct"
          + "sensitivity" = "PII/PHI"
        }
      + tags_all                  = {
          + "application" = "ConversionTool"
          + "environment" = "prod"
          + "owner"       = "qppar-final-scoring"
          + "project"     = "qppsf-ct"
          + "sensitivity" = "PII/PHI"
        }

      + stream_mode_details {
          + stream_mode = (known after apply)
        }
    }

  # module.conversion-tool.aws_lambda_event_source_mapping.kinesis_lambda_source will be created
  + resource "aws_lambda_event_source_mapping" "kinesis_lambda_source" {
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + starting_position             = "TRIM_HORIZON"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.conversion-tool.aws_lambda_function.kinesis_cw_lambda will be created
  + resource "aws_lambda_function" "kinesis_cw_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../modules/Kinesis-cloudwatch-splunk.zip"
      + function_name                  = "ConversionTool-prod"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SPLUNK_TOKEN" = (sensitive)
              + "SPLUNK_URL"   = (sensitive)
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.conversion-tool.aws_security_group.ct_app will be updated in-place
  ~ resource "aws_security_group" "ct_app" {
        id                     = "sg-0e171ff1419a3a8ce"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0ddf985740c094a69",
                ]
              - self             = false
              - to_port          = 8443
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 8443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0ddf985740c094a69",
                ]
              - self             = false
              - to_port          = 8443
            },
          + {
              + cidr_blocks      = []
              + description      = null
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-0ddf985740c094a69",
                ]
              + self             = false
              + to_port          = 8443
            },
        ]
        name                   = "conversion-tool-app-prod"
        tags                   = {
            "Name" = "conversion-tool-app-prod"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 10 to add, 1 to change, 0 to destroy.

DEVPRE:

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.conversion-tool.aws_cloudwatch_log_subscription_filter.cw-kinesis-subscription-filter will be created
  + resource "aws_cloudwatch_log_subscription_filter" "cw-kinesis-subscription-filter" {
      + destination_arn = (known after apply)
      + distribution    = "Random"
      + id              = (known after apply)
      + log_group_name  = "/qppsf/conversion-tool-devpre"
      + name            = "cwlogs-subscription-to-kinesis"
      + role_arn        = (known after apply)
    }

  # module.conversion-tool.aws_iam_policy.cwlogs_to_kinesis_policy will be created
  + resource "aws_iam_policy" "cwlogs_to_kinesis_policy" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "cloudwatch-to-kinesis-devpre"
      + path      = "/delegatedadmin/developer/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.conversion-tool.aws_iam_policy.kinesis_lambda_policy_role will be created
  + resource "aws_iam_policy" "kinesis_lambda_policy_role" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "conversiontool_kinesis_lambda_role_policy-devpre"
      + path      = "/delegatedadmin/developer/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.conversion-tool.aws_iam_role.cwlogs_to_kinesis will be created
  + resource "aws_iam_role" "cwlogs_to_kinesis" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "logs.us-east-1.amazonaws.com"
                        }
                      + Sid       = "AllowCloudwatchtoKinesis"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "qppsf-ct-cloudwatch-to-kinesis-devpre"
      + name_prefix           = (known after apply)
      + path                  = "/delegatedadmin/developer/"
      + permissions_boundary  = "arn:aws:iam::003384571330:policy/cms-cloud-admin/developer-boundary-policy"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.conversion-tool.aws_iam_role.kinesis_lambda_role will be created
  + resource "aws_iam_role" "kinesis_lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "AllowLambda"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "qppsf-ct-kinesis_lambda_role-devpre"
      + name_prefix           = (known after apply)
      + path                  = "/delegatedadmin/developer/"
      + permissions_boundary  = "arn:aws:iam::003384571330:policy/cms-cloud-admin/developer-boundary-policy"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.conversion-tool.aws_iam_role_policy_attachment.cwlogs_to_kinesis_policy will be created
  + resource "aws_iam_role_policy_attachment" "cwlogs_to_kinesis_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "qppsf-ct-cloudwatch-to-kinesis-devpre"
    }

  # module.conversion-tool.aws_iam_role_policy_attachment.kinesis_lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "kinesis_lambda_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "qppsf-ct-kinesis_lambda_role-devpre"
    }

  # module.conversion-tool.aws_kinesis_stream.kinesis-stream-cw-logs will be created
  + resource "aws_kinesis_stream" "kinesis-stream-cw-logs" {
      + arn                       = (known after apply)
      + encryption_type           = "KMS"
      + enforce_consumer_deletion = false
      + id                        = (known after apply)
      + kms_key_id                = "alias/aws/kinesis"
      + name                      = "conversion-tool-devpre-kinesis-stream"
      + retention_period          = 192
      + shard_count               = 1
      + tags                      = {
          + "application" = "ConversionTool"
          + "environment" = "devpre"
          + "owner"       = "qppar-final-scoring"
          + "project"     = "qppsf-ct"
          + "sensitivity" = "PII/PHI"
        }
      + tags_all                  = {
          + "application" = "ConversionTool"
          + "environment" = "devpre"
          + "owner"       = "qppar-final-scoring"
          + "project"     = "qppsf-ct"
          + "sensitivity" = "PII/PHI"
        }

      + stream_mode_details {
          + stream_mode = (known after apply)
        }
    }

  # module.conversion-tool.aws_lambda_event_source_mapping.kinesis_lambda_source will be created
  + resource "aws_lambda_event_source_mapping" "kinesis_lambda_source" {
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + starting_position             = "TRIM_HORIZON"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.conversion-tool.aws_lambda_function.kinesis_cw_lambda will be created
  + resource "aws_lambda_function" "kinesis_cw_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + filename                       = "../modules/Kinesis-cloudwatch-splunk.zip"
      + function_name                  = "ConversionTool-devpre"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 30
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "SPLUNK_TOKEN" = (sensitive)
              + "SPLUNK_URL"   = (sensitive)
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.conversion-tool.aws_security_group_rule.ct-ingress-from-https-elb-to-ui will be created
  + resource "aws_security_group_rule" "ct-ingress-from-https-elb-to-ui" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-07205d6051519c30a"
      + self                     = false
      + source_security_group_id = "sg-0dbc84bd77b8b70e5"
      + to_port                  = 8443
      + type                     = "ingress"
    }

Plan: 11 to add, 0 to change, 0 to destroy.